
## Plan Result (prod)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.app_insight_viewers_monitoring_prod[0]
  * azurerm_role_assignment.app_insight_viewers_prod[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app_insight_viewers_monitoring_prod[0] will be created
  + resource "azurerm_role_assignment" "app_insight_viewers_monitoring_prod" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b5f5ebcc-4d49-4b00-9826-3cbda4f40006"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_insight_viewers_prod[0] will be created
  + resource "azurerm_role_assignment" "app_insight_viewers_prod" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b5f5ebcc-4d49-4b00-9826-3cbda4f40006"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Insights Component Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-prod/loggers/sds-api-mgmt-prod-logger"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":204,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->